---
title: KeyBasedTreeEntriesLoadContent
classe: Autodesk.Revit.DB.KeyBasedTreeEntriesLoadContent
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.ExternalResourceLoadContent
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# KeyBasedTreeEntriesLoadContent

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean AddEntry(KeyBasedTreeEntry)` | `keyBasedTreeEntriesLoadContent.AddEntry(entry)` | Boolean |
| `Void BuildEntries()` | `keyBasedTreeEntriesLoadContent.BuildEntries()` | Void |
| `Boolean CanAddEntry(KeyBasedTreeEntry)` | `keyBasedTreeEntriesLoadContent.CanAddEntry(entry)` | Boolean |
| `KeyBasedTreeEntries GetEntries()` | `keyBasedTreeEntriesLoadContent.GetEntries()` | KeyBasedTreeEntries |
| `KeyBasedTreeEntriesLoadResults GetLoadResults()` | `keyBasedTreeEntriesLoadContent.GetLoadResults()` | KeyBasedTreeEntriesLoadResults |
| `Boolean IsEntriesBuilt(KeyBasedTreeEntriesLoadContent)` | `KeyBasedTreeEntriesLoadContent.IsEntriesBuilt(content)` | Boolean |
| `Void Reset()` | `keyBasedTreeEntriesLoadContent.Reset()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```